emsesp/EMS-ESP32/src/core/system.cpp
    uint8_t  device_id = 0; // is in hex
    uint16_t type_id   = 0; // is in hex
    uint8_t  length    = 0;
    uint8_t  offset    = 0;

    // first check deviceID
    if ((p = strtok(data_args, " ,"))) {               // delimiter comma or space
        strlcpy(value, p, sizeof(value));              // get string
        device_id = (uint8_t)Helpers::hextoint(value); // convert hex to int
        if (!EMSESP::valid_device(device_id)) {
            LOG_ERROR("Invalid device ID (0x%02X) in read command", device_id);
            return false; // invalid device
        }
    }

    // iterate until end
    uint8_t num_args = 0;
    while (p != 0) {
        if ((p = strtok(nullptr, " ,"))) {    // delimiter comma or space
            strlcpy(value, p, sizeof(value)); // get string
            if (num_args == 0) {
                type_id = (uint16_t)Helpers::hextoint(value); // convert hex to int
            } else if (num_args == 1) {
                offset = Helpers::atoint(value); // decimal
            } else if (num_args == 2) {
                length = Helpers::atoint(value); // decimal
            }
            num_args++;
        }
    }

    if (num_args == 0) {
        return false; // invalid number of arguments
    }

    EMSESP::send_read_request(type_id, device_id, offset, length, true);
    EMSESP::set_read_id(type_id);

    return true;
}

// system read command
bool System::command_read(const char * value, const int8_t id) {
    return readCommand(value);
}

// set the system status code - SYSTEM_STATUS in system.h
void System::systemStatus(uint8_t status_code) {
    systemStatus_ = status_code;
    // LOG_DEBUG("Setting System status code %d", status_code);
}

uint8_t System::systemStatus() {
    return systemStatus_;
}

// takes a string range like "6-11, 1, 23, 24-48" which has optional ranges and single values and converts to a vector of ints
std::vector<uint8_t> System::string_range_to_vector(const std::string & range) {
    std::vector<uint8_t>   valid_gpios;
    std::string::size_type pos  = 0;
    std::string::size_type prev = 0;

    auto process_part = [&valid_gpios](std::string part) {
        // trim whitespace
        part.erase(0, part.find_first_not_of(" \t"));
        part.erase(part.find_last_not_of(" \t") + 1);

        // check if it's a range (contains '-')
        std::string::size_type dash_pos = part.find('-');
        if (dash_pos != std::string::npos) {
            // it's a range like "6-11"
            int start = std::stoi(part.substr(0, dash_pos));
            int end   = std::stoi(part.substr(dash_pos + 1));
            for (int i = start; i <= end; i++) {
                valid_gpios.push_back(static_cast<uint8_t>(i));
            }
        } else {
            valid_gpios.push_back(static_cast<uint8_t>(std::stoi(part)));
        }
    };

    while ((pos = range.find(',', prev)) != std::string::npos) {
        process_part(range.substr(prev, pos - prev));
        prev = pos + 1;
    }

    // handle the last part
    process_part(range.substr(prev));

    return valid_gpios;
}

// return a list of valid GPIOs for the ESP32 board
// notes:
//  - we allow 0, which is used sometimes to indicate a disabled pin
//  - also allow input only pins are accepted (34-39) on some boards
//  - and allow pins 33-38 for octal SPI for 32M vchip version on some boards
std::vector<uint8_t> System::valid_gpio_list() {
    // get free gpios based on board/platform type
#if CONFIG_IDF_TARGET_ESP32C3
    // https://www.wemos.cc/en/latest/c3/c3_mini.html
    std::vector<uint8_t> valid_gpios = string_range_to_vector("0-10");
#elif CONFIG_IDF_TARGET_ESP32S2
    std::vector<uint8_t> valid_gpios = string_range_to_vector("0-14, 19, 20, 21, 33-38, 45, 46");
#elif CONFIG_IDF_TARGET_ESP32S3
    std::vector<uint8_t> valid_gpios = string_range_to_vector("2, 4-14, 17, 18, 21, 33-38, 45, 46");
#elif CONFIG_IDF_TARGET_ESP32 || defined(EMSESP_STANDALONE)
    std::vector<uint8_t> valid_gpios = string_range_to_vector("0, 2, 4, 5, 12-15, 18, 19, 23, 25-27, 32-39");
#else
    std::vector<uint8_t> valid_gpios = {};
#endif

#if CONFIG_IDF_TARGET_ESP32
    // if psram is enabled remove pins 16 and 17 from the list
    if (ESP.getPsramSize() > 0) {
        valid_gpios.erase(std::remove(valid_gpios.begin(), valid_gpios.end(), 16), valid_gpios.end());
        valid_gpios.erase(std::remove(valid_gpios.begin(), valid_gpios.end(), 17), valid_gpios.end());
    }
#endif

    // if ethernet is enabled, remove pins 21 and 22 (I2C)
    if ((EMSESP::system_.ethernet_connected() || EMSESP::system_.phy_type_ != PHY_type::PHY_TYPE_NONE)) {
        valid_gpios.erase(std::remove(valid_gpios.begin(), valid_gpios.end(), 21), valid_gpios.end());
        valid_gpios.erase(std::remove(valid_gpios.begin(), valid_gpios.end(), 22), valid_gpios.end());
    }

    // filter out GPIOs already used in application settings, gpio 0 means disabled, except for pbutton
    for (const auto & gpio : valid_gpios) {
        if (gpio == EMSESP::system_.pbutton_gpio_
            || (gpio
                && (gpio == EMSESP::system_.led_gpio_ || gpio == EMSESP::system_.dallas_gpio_ || gpio == EMSESP::system_.rx_gpio_
                    || gpio == EMSESP::system_.tx_gpio_))) {
            valid_gpios.erase(std::remove(valid_gpios.begin(), valid_gpios.end(), gpio), valid_gpios.end());
        }
    }

    // filter out GPIOs already used in analog sensors, if enabled
    if (EMSESP::system_.analog_enabled_) {
        for (const auto & sensor : EMSESP::analogsensor_.sensors()) {
            if (std::find(valid_gpios.begin(), valid_gpios.end(), sensor.gpio()) != valid_gpios.end()) {
                valid_gpios.erase(std::find(valid_gpios.begin(), valid_gpios.end(), sensor.gpio()));
            }
        }
    }

    // sort the list of valid GPIOs
    std::sort(valid_gpios.begin(), valid_gpios.end());

    return valid_gpios;
}

} // namespace emsesp
